# ------------------------------------------------------------------
# META SCAN - Local Filter Module
# Copyright (c) 2026 Sakhr AlHubaish. All Rights Reserved.
# ------------------------------------------------------------------

SUSPICIOUS_KEYWORDS = {
    "financial": [
        "ربح سريع", "ثراء فاحش", "ضعف أموالك", "استثمار مضمون", "بدون مجهود", 
        "دخل اضافي مضمون", "قرض فوري بدون ضمانات", "ربح مضمون 100%"
    ],
    "health": [
        "علاج سحري", "خسارة الوزن بدون ديّت", "نتيجة مضمونة خلال أيام", 
        "شفاء تام", "مرخص طبياً (بدون إثبات)", "دواء معجزة"
    ],
    "behavioral": [
        "اضغط هنا فوراً", "لا تفوت الفرصة", "الربح للجميع", "سارع قبل نفاد الكمية (وهمي)",
        "اكسب آلاف الدولارات يومياً"
    ],
    "political_and_sensitive": [


الحوثيون، أنصار الله، جماعة الحوثي، صنعاء، مأرب، تعز، عدن، المجلس الانتقالي الجنوبي، الحكومة اليمنية، الحكومة الشرعية، الشرعية، الانقلاب، الانقلابيون، الصراع اليمني، الحرب في اليمن، الهدنة، وقف إطلاق النار، اتفاق السلام، المفاوضات السياسية، الأزمة اليمنية، الأزمة الإنسانية، النزوح، المعتقلون السياسيون، الأسرى، السجناء السياسيون، الاختفاء القسري، الاعتقالات، القمع، حرية التعبير، الاحتجاجات الشعبية، المظاهرات، العصيان المدني، الحوثي، تقسيم اليمن، الانفصال، الوحدة اليمنية، القضية الجنوبية، النفوذ الإيراني، النفوذ السعودي، التجنيد، التجنيد الإجباري، الألغام، انتهاكات حقوق الإنسان،فلسطين، غزة، الضفة الغربية، القدس، إسرائيل، الاحتلال الإسرائيلي، المقاومة الفلسطينية، حماس، الجهاد الإسلامي، حزب اللات،المقاومة المسلحة،، هتلر ، النازية ، القتال ، الاقتتال ، الحرب، سحل ، الأسلحة النووية ، استشهاد، الشهيد، الموت لأمريكا، الموت لامريكا ، الموت لإسرائيل،  الموت لأسرائيل  ، الموت لاسرائيل ، اللعنة على اليهود ، اللعنه على اليهود


    ]
}